app/views/tasks/_form.html.erb

SELECT "locations".* FROM "locations"
---
    <strong><%= f.label :location_id %></strong><br>
    <!-- <%= f.collection_check_boxes :location_id, Location.all, :id, :name %><br></br> -->
    <%= f.select(:location_id) do %>
        <%= options_from_collection_for_select(Location.all, :id, :name, :selected => @task.location_id) %>

SELECT "users".* FROM "users"
---
    <strong><%= f.label :user_id %></strong><br>
    <!--<%= f.collection_check_boxes :user_id, User.all, :id, :name %><br> -->
    <%= f.select(:user_id) do %>
        <%= options_from_collection_for_select(User.all, :id, :name, :selected => @task.user_id) %>