app/views/users/show.html.erb

            <% if @user.tasks %>
                <% @user.tasks.each do |a| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 3]]