app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "The House"], ["notes", "123 Anyroad dr\r\nTown, CA 99999"], ["created_at", "2019-09-16 05:48:18.284278"], ["updated_at", "2019-09-16 05:48:18.284278"]]
SELECT  "locations".* FROM "locations" WHERE (3) LIMIT ?  [["LIMIT", 1]]
---
    def create
        @location = Location.new(location_params)
        if @location.save
            redirect_to location_path(@location)
        else
            redirect_to new_location_path(@location), error: "Error: #{@location.errors.full_messages.join(", ")}"

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @location = Location.find_by_id(params[:id])

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @location = Location.find_by_id(params[:id])

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "locations" SET "name" = ?, "notes" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["name", "The Store"], ["notes", "Target"], ["updated_at", "2019-09-16 21:20:29.089699"], ["id", 3]]
---
    def update
        @location = Location.find_by(id: params[:id])
        if @location.update(location_params)

DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 2]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def destroy
        Location.find(params[:id]).destroy

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_location
        @location = Location.find_by(id: params[:id])