app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "uid", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "104554930942095"], ["LIMIT", 1]]
---
    def facebook
        @user = User.find_or_create_by(uid: auth['uid']) do |c|

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Jason G"], ["LIMIT", 1]]
---
    def login
        @user = User.find_by(name: params[:user][:name])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
        @user = User.find_by(:id => session[:user_id])