app/controllers/tasks_controller.rb

    def create
        @task = Task.new(task_params)
        if @task.save!
---
INSERT INTO "tasks" ("name", "description", "user_id", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Feed the Dog"], ["description", "He's Hungry!"], ["user_id", 1], ["location_id", 1], ["created_at", "2019-09-16 05:49:14.349577"], ["updated_at", "2019-09-16 05:49:14.349577"]]

    def show
        @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

    def update
        @task = Task.find_by(id: params[:id])

        @task.update(task_params)
        if @task.save
            redirect_to task_path(@task)
        else
            redirect_to edit_task_path(@task), error: "Error: #{@task.errors.full_messages.join(", ")}"
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Ruby on Rails."], ["updated_at", "2019-09-16 21:01:58.616095"], ["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        Task.find(params[:id]).destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

    def set_task
        @task = Task.find_by(:location_id => params[:location_id], :id => params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."location_id" = ? AND "tasks"."id" = ? LIMIT ?  [["location_id", 2], ["id", 1], ["LIMIT", 1]]

    def set_location
        @location = Location.find_by(id: params[:location_id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" IS NULL LIMIT ?  [["LIMIT", 1]]