app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "job", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def edit
        @user = User.find_by(id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @user = User.find_by(id: params[:id])

        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "jasongutierrez@gmail.com"], ["updated_at", "2019-09-17 00:01:59.368230"], ["id", 1]]