app/views/locations/new.html.erb

SELECT "users".* FROM "users"
---
        <p>Select a user:
        <%= select_tag 'location[tasks_attributes][0][user_id]', content_tag(:option,'select one...',:value=>"")+options_from_collection_for_select(User.all, :id, :name) %></p>