app/views/locations/show.html.erb

<% @users.each do |c| %>
    <% a = Task.find_by(:location_id => @location.id, :user_id => c.id) %>
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."location_id" = ? AND "tasks"."user_id" = ? LIMIT ?  [["location_id", 1], ["user_id", 1], ["LIMIT", 1]]